
"""
    1.现在有2个变量，分别为:
    a = 10
    b = 20
    现在需要将两个变量的值交换，然后输出到控制台
"""

def func01():
    a = 10
    b = 20
    a,b = b,a
    print(f"a = {a}")
    print(f"b = {b}")

# func01()

"""
    2. 现在有3个变量，分别为：
    a = 100
    b = 200
    c = 300
    现在需要将3个变量的值交换，将a,b,c的值赋值给 c,a,b, 然后输出到控制台
"""

def func02():
    a = 100
    b = 200
    c = 300
    c,a,b = a,b,c
    print(f"a = {a}")
    print(f"b = {b}")
    print(f"c = {c}")

# func02()

"""
根据如下的学生成绩单完成以下需求:
1:计算每个学生的总分，各科目的平均分，然后一一输出出来
2:统计各科成绩的：最低分，最高分，平均分，并输出
3：查找成绩优秀（平均分大于90分）的学生并且输出出来
"""

def use_case_part01():
    students = (
        ("s001","王林",85,92,78),
        ("s002","李慕婉",92,88,95),
        ("s003","十三",78,85,82),
        ("s004","曾牛",88,79,91),
        ("s005","周铁",95,96,89),
        ("s006","王卓",76,82,77),
        ("s007","红蝶",81,99,94),
        ("s008","徐立国",75,69,82),
        ("s009","许木",86,89,98),
        ("s010","遁天",66,59,72),)
    
    # 1:计算每个学生的总分，各科目的平均分，然后输出出来
    print("学号:\t 姓名:\t 语文:\t 数学:\t 英文:\t 总分:\t 平均分:\t")
    #我首先要遍历这个元组吧
    for s in students:
        #一整个元组里面其实都是一行的元组，不同学生的信息
        # 总分
        total_score = s[2] + s[3] + s[4]
        #平均分
        average_score = total_score / 3
        #打印
        print(f"{s[0]}\t {s[1]}\t {s[2]}\t {s[3]}\t {s[4]}\t {total_score}\t {average_score:.2f}\t")

# use_case_part01()


# 2:统计各科成绩的：最低分，最高分，平均分，并输出
def use_case_part02():

    students = (
        ("s001","王林",85,92,78),
        ("s002","李慕婉",92,88,95),
        ("s003","十三",78,85,82),
        ("s004","曾牛",88,79,91),
        ("s005","周铁",95,96,89),
        ("s006","王卓",76,82,77),
        ("s007","红蝶",81,99,94),
        ("s008","徐立国",75,69,82),
        ("s009","许木",86,89,98),
        ("s010","遁天",66,59,72),)
    
    #那我首先要先遍历，然后s[2]= 语文, s[3] = 数学, s[4] = 英文
    chinese_score = [s[2] for s in students]
    math_score = [s[3] for s in students]
    english_score = [s[4] for s in students]
    print("-----------------------------------")

    #英文成绩的信息
    print(f"英文最低分: {min(english_score)}")
    print(f"英文最高分: {max(english_score)}")
    print(f"英文平均分: {sum(english_score) / len(english_score)}")
    print("-----------------------------------")

    #中文成绩的信息
    print(f"中文的最低分: {min(chinese_score)}")
    print(f"中分的最高分: {max(chinese_score)}")
    print(f"中文的平均分: {sum(chinese_score) / len(chinese_score)}")
    print("-----------------------------------")

    #数学成绩的信息
    print(f"数学的最低分: {min(math_score)}")
    print(f"数学的最高分: {max(math_score)}")
    print(f"数学的平均分: {sum(math_score) / len(math_score)}")
    
# use_case_part02()
    

# 3：查找成绩优秀（平均分大于90分）的学生并且输出出来
def use_case_part03():
    students = (
        ("s001","王林",85,92,78),
        ("s002","李慕婉",92,88,95),
        ("s003","十三",78,85,82),
        ("s004","曾牛",88,79,91),
        ("s005","周铁",95,96,89),
        ("s006","王卓",76,82,77),
        ("s007","红蝶",81,99,94),
        ("s008","徐立国",75,69,82),
        ("s009","许木",86,89,98),
        ("s010","遁天",66,59,72),)
    
    #那我是不是要先遍历我的每一层元组，然后累加成绩，然后找出每个人的平均分
    for s in students:
        total_score = s[2] + s[3] + s[4]
        avg_score = total_score / 3
        if avg_score >= 90:
            print(f"学号: {s[0]} 姓名: {s[1]} 平均分: {avg_score:.2f}")


# use_case_part03()
    
