
"""
1.现在有2个变量，分别为:
    a = 10
    b = 20
    现在需要将两个变量的值交换，然后输出到控制台
"""

def func01():
    """
    为什么可以这么写?????
    因为这就像组包的操作: 
        t = (b, a) -> b = 20, a = 10
    然后我在解包:
        a,b = t ->这不就是把 (20,10),分别先给了a，然后再给了b吗
    """
    a = 10
    b = 20
    a,b = b,a
    print(a)
    print(b)

# func01()


"""
    2. 现在有3个变量，分别为：
    a = 100
    b = 200
    c = 300
    现在需要将3个变量的值交换，将a,b,c的值赋值给 c,a,b, 然后输出到控制台
"""
def func02():
    #理想的状态下 c = 100, a = 200, b = 300
    a,b,c = 100,200,300
    c,a,b = a,b,c
    print(f"c = {c}")
    print(f"b = {b}")
    print(f"a = {a}")

func02()
