
"""
根据如下的学生成绩单完成以下需求:
1:计算每个学生的总分，各科目的平均分，然后一一输出出来
2:统计各科成绩的：最低分，最高分，平均分，并输出
3：查找成绩优秀（平均分大于90分）的学生并且输出出来
"""

def my_query01():

    students_info = (
        ("s001","王林",85,92,78),
        ("s002","李慕婉",92,88,95),
        ("s003","十三",78,85,82),
        ("s004","曾牛",88,79,91),
        ("s005","周铁",95,96,89),
        ("s006","王卓",76,82,77),
        ("s007","红蝶",81,99,94),
        ("s008","徐立国",75,69,82),
        ("s009","许木",86,89,98),
        ("s010","遁天",66,59,72))
    
    # 1:计算每个学生的总分，各科目的平均分，然后一一输出出来
    print("学号\t姓名\t语文\t数学\t英文\t总分\t平均分\t")
    for s in students_info:
        total = s[2] + s[3] + s[4]
        avg = total / 3
        print(f"{s[0]}\t{s[1]}\t{s[2]}\t{s[3]}\t{s[4]}\t{total}\t{avg:.2f}\t")


# 2:统计各科成绩的：最低分，最高分，平均分，并输出
def my_query_02():
    students_info = (
        ("s001","王林",85,92,78),
        ("s002","李慕婉",92,88,95),
        ("s003","十三",78,85,82),
        ("s004","曾牛",88,79,91),
        ("s005","周铁",95,96,89),
        ("s006","王卓",76,82,77),
        ("s007","红蝶",81,99,94),
        ("s008","徐立国",75,69,82),
        ("s009","许木",86,89,98),
        ("s010","遁天",66,59,72))
    
    chinese_score = [s[2] for s in students_info]
    math_score = [s[3] for s in students_info]
    eng_score = [s[4] for s in students_info]

    print(f"语文最低分: {min(chinese_score)}")
    print(f"语文成绩最高分: {max(chinese_score)}")
    print(f"语文平均分: {sum(chinese_score)/len(chinese_score)}") 

    print("-----------------------------")

    print(f"数学最低分: {min(math_score)}")
    print(f"数学最高分: {max(math_score)}")
    print(f"数学平均分: {sum(math_score) / len(math_score)}")

    print("-----------------------------")

    print(f"英文最低分: {min(eng_score)}")
    print(f"英文最高分: {max(eng_score)}")
    print(f"语文平均分: {sum(eng_score) / len(eng_score)}")
    

# 3：查找成绩优秀（平均分大于90分）的学生并且输出出来
def my_func_03():

    students_info = (
        ("s001","王林",85,92,78),
        ("s002","李慕婉",92,88,95),
        ("s003","十三",78,85,82),
        ("s004","曾牛",88,79,91),
        ("s005","周铁",95,96,89),
        ("s006","王卓",76,82,77),
        ("s007","红蝶",81,99,94),
        ("s008","徐立国",75,69,82),
        ("s009","许木",86,89,98),
        ("s010","遁天",66,59,72))
    

    #如果要知道成绩是否优秀的话就要知道每个学成的平均分(总成绩/几门科目)
    for s in students_info:
        total = s[2] + s[3] + s[4]
        avg = total / 3
        if avg > 90:
            print(f"学号: {s[0]}, 姓名: {s[1]}, 平均分为: {avg:.2f}")
        
# my_func_03()

# my_query_02()
        
    
# my_query01()